[
"What is that one thing which you are always proud of?",
"What is it that always brings a smile on your face no matter how your day was?",
"What normally brightens your day?",
"Which event in your life do you think was the scariest?",
"What childhood memory do you cherish so much?",
"What is that one think that you are thankful about in life?",
"What is your biggest fear?",
"Which is that one movie that you can watch over and over again without getting fed up?",
"What is the best moment in your life?",
"Which movie star do you wish to meet?",
"Which event in life excites you the most?",
"Can you tell me one secret that you have never shared even with your best friend?",
"If you are told to leave your country and choose another one, which three countries will you chose from?",
"Can you take a pig as a pet?",
"What is the name of your closest family member?",
"What is your favorite candy flavor?",
"Who is your favorite comedian?",
"Which is the most boring show you ever attended?",
"What is it that you can rewrite about your future given a chance?",
"Which part of your body amazes you the most?",
"Which of your personality do you love the most?",
"Whom do you go for consolation and sometimes advice when you feeling down?",
"If you were to choose one meal to eat the rest of your life, which one could you choose?",
"What is it that you are passionate about the most?",
"Which one of the five senses to you think you least need and you cannot mind losing it in case you have to loose one of your senses?",
"What do you think is the hardest decision you ever made?",
"Which physical activity have you ever engaged in and you swear never to do it again since the experience was awful?",
"What do you love the most about your current job?",
"How many jobs have you done ever since you graduated from college?",
"Which wild animal can you compare your character with?",
"Which one question do you feel you have never got a contented answer on?",
"Do you believe in reincarnation?",
"Which three words do you think best describes who you are?",
"Which country do you think is the coolest and you intend to visit very soon?",
"What one thing do people misjudge you about the first time they see you?",
"What attracts you to the opposite gender?",
"What traits do you always look for in a lady?",
"Which girls characters do you think are a turn off to most guys?",
"What do you think is the sweetest thing you ever did to a lady?",
"What nickname do your buddies call you?",
"How can you describe your home town in one word?",
"Which is your favorite pub in town and why do you like it the most?",
"What do you think makes an ideal date?",
"What is your all time wish?",
"Which activates do you engages in during your free time?",
"Whom do you think has ever given you the best complement that you will never forget?",
"What is it you think is your talent?",
"Do you know how to cook?",
"Which was your favorite joint in college?",
"How can you describe your close friends in six words?",
"Which state in the United States do you feel has the highest level of racism and you do not wish to visit?",
"You believe that Donald Trump will make America great again?",
"Which one think do you want to accomplish within the next 5 years?",
"Can you kill the person you hate in life for five million dollars?",
"Which one decision do you think changed your life for the better?",
"What is your favorite genre of music?",
"Do you have any regret in life?",
"What motivates you in life?",
"What do you think is your guilty pleasure? Junk food, snacks or drink?",
"Which three fast food would you choose from when forced to eat fast foods for the rest of your life?",
"Which fast food do have crave on?",
"Do you have any trait that you are not proud of?",
"If given an opportunity to begin your life again, can you go back to your mother’s womb?",
"What was your feeling when you lost your close family member?",
"Have you ever cried over heart breaks?",
"Do you have a favorite social network profile?",
"What do you do every time you are disappointed?",
"Can you recall the last time you cried? What was it about?",
"What thing about the future scares you the most?",
"Do you love children? How many girls and boys do you wish to have?",
"Have you formulated a hypothesis of your future family?",
"Do you have one thing that you cannot live without?",
"Who is that one person that brightens your life?",
"What do you love about the Chinese?",
"Which name of a country do you think is very funny?",
"Do you have a favorite sentence, poetic line or quote?",
"How many lovers have you had in life so far?",
"Based on your last relationship, how can you describe love?",
"How can you describe your first love?",
"What one think do you find consistence about the ladies you have dated so far?",
"Do you have a favorite pop star?",
"How many years do you think you are remaining with before you die?",
"How many years from now do you want to settle?",
"What attracted you the most to me?",
"Do you have a favorite word?",
"How much money do you think will quench your thirst for cash?",
"Do you think gambling is the key to easy money?",
"How often do you dream? What is it about?",
"Which childhood toy do you still have and you always play with?",
"Which billionaire do you admire the most?",
"Who is your role model?",
"What is your all time joke?",
"Would you donate your body for medical studies when you die?",
"Which character about me do you think it the most weird?",
"Do you have a celebrity crush?+",
"Can you remember the first time you had wet dreams?",
"Between texting and phone call, which one do you prefer?",
"Do you have favorite movie site?",
"What is the name of the biggest scammer you ever came across in life?",
"Do you have any phobia?",
"If you were given a chance to change your career, what could be your dream job?",
"Which Hollywood star could you wish to have lunch with?",
"What is the ideal height for the partner of your dreams?",
"In case of reincarnation, whom would you wish to become?",
"Am just curious, do you go out often?",
"What could you tell the world if it was listening to you right now?",
"How is the weather at your place? Can I come over?",
"What is in your mind?",
"Do you have a boyfriend?",
"How has been your relationships lately? Any heart breaks?",
"If I faint right now, what first thing could you do?",
"Which is your favorite sea animal that you wish you could be in case you were a sea animal?",
"Do you love reading books? If yes, who is your favorite author and why?",
"Picture this, if we had only three options in life, freedom, fame and money. Which one could you choose and why?",
"Do you believe that cash is the source of happiness? Why?",
"What could you carry if it was possible to carry one thing with you to the after death?",
"If you were to be a pig or a donkey, which one could you like to be?",
"When did you lose your virginity?",
"How many men have you slept with in your life and how old was the eldest?",
"Which is your best storybook so far?",
"Have you been involved in a gristly road accident?",
"How frequent do you visit your parents?",
"Have you ever been at fault for a gristly road accident?",
"In a scale of 100 how do you rate the importance of money in your life?",
"How many keys are in your bunch of keys?",
"How often do you cut your nails?",
"Which celebrity do you hate the most?",
"What could you buy if you are given a 20000$ voucher to spent it within 24 hours?",
"Do you love making new friends?",
"How many strangers/one night stand have you encountered up to date?",
"Which was the brand of your first phone?",
"How often would you wish to make love?",
"If I was contemplating suicide, what could be your final word to me?",
"Which famous person do you wish he/she should not have died?",
"Which favorite food could you cook for your friend who has just visited your country?",
"What could be your reaction if you give birth to a child who is physically challenged?",
"Do you believe there exist perfect date?",
"What could you do if you are remaining with 6months to live in this world?",
"Which model of car do you think best describes who you are?",
"Have you ever contacted any STI?",
"How often do you get tested for HIV/Aids?",
"What do you see yourself in the next seven years?",
"Do you think Hillary Clinton could have made the best U.S president? Why?",
"If you could be a philosopher, who could you wish to be?",
"Do you think atheists view on religion and spiritualism is correct?",
"How many glasses of water do you take per day?",
"Which song do you think the singer did not do his or her best?",
"Whom do you think would have made the best president? Why?",
"Can you date a guy twice your age?",
"If you are given one million dollars, how do you think it will change your life?",
"Which relative don’t you like in your extended family?",
"Do you believe in true love?",
"Which one person do you love the most in this world?",
"How often have you traveled to Africa?",
"Which country would you not visit even if you are given free ticket and accommodation in a five star hotel?",
"Which movie do you think best describes your life?",
"What came in your mind the first time you saw me?",
"Do you think am your dream guy? Why?",
"Do you believe that education is the key to get you away from poverty?",
"How often do you go to church?",
"Which is your favorite yogurt flavor and which one is your worst flavor?",
"What is the most embarrassing thing that ever happened in your life?",
"Which three types of food can’t you get enough of and you can eat it for the rest of your life?",
"How old you think is the best age for a woman to get married? And a man?",
"What is your name Amor?",
"Which name would you call your child if she was a girl?",
"What do you enjoy doing with your partner?",
"How many times have you made peace in your life?",
"Have you ever had depression in your life?",
"How often do you exercise?",
"Which was your worst subject while in college? Why?",
"Which part of your body would you amend if given a change by God?",
"How many kids do you think would make your life complete ?",
"Which is your favorite alcohol brand?",
"In a scale of one to ten, how attractive can you rank yourself?",
"What is your hobby?",
"What do you normally do in your free time?",
"What was your expectation in your first date? How was the experience?",
"How often do you update your Instagram?",
"Can you sleep with your cousin? Why?",
"Do you love me?",
"Do you still have feelings for your “first love”?",
"Do you m@sturbate? Why?",
"How many bedrooms will your dream house have?",
"How many minutes do you think a perfect love making session should last?",
"Have you ever dated a pervert?",
"Which is your favorite meeting station in town?",
"Which co curriculum activity were you a member in while in College?",
"How old were you when you first went to watch a movie in a cinema?",
"How long did your first relationship last?",
"Do you think you can make a good team leader? Why?",
"Describe a perfect man in five words?",
"Which is your dream city that you wish to go on vacation?",
"Which social media site do you visit often?",
"How can you rate your achievement so far out of 100?",
"Have you ever been admitted in hospital?",
"Which fast food do you love?",
"Will you be free tomorrow?",
"Have you ever ate crayfish?",
"How can you describe your workplace boss in 2 words?",
"What comes in your mind every time we hug each other tightly?",
"When did you know I was the one for you?",
"What always comes in your mind each morning see me lying on the bed?",
"Where will you take me on a vacation the moment we get married?",
"If I am given a job transfer to a different country, will you come with me?",
"Will you stick with me in case of a long distance relationship with minimal communication?",
"What always come in your mind every time we are apart?",
"Can you marry someone if she proposes on your fast date?",
"Can you accept a lady’s offer to pay the bills on your fast date?",
"Which date did you enjoy the most of all the dates we had?",
"What do you wish I do to spice up our relationship?",
"Do you think I am your soulmate?",
"What is your definition of soulmates?",
"When will you be ready to meet my parent?",
"When will you take me to meet your parents?",
"Do your parents like me?",
"Can you confess on live TV show that you love me?",
"Do you think we coming together was God’s plans?",
"What did you think of me on our first date?",
"Do you still recall how we met?",
"What caught your attention the first time you saw me?",
"What ran in your mind on our first kiss?",
"When will you be ready to formalize our relationship?",
"Which movie star can you compare my physique with?",
"What made you to love me even more?",
"Did you want to kill me on our first date?",
"Do you like kissing in the rain, dark or in public more?",
"Do you think I am the best kisser?",
"Do you like kissing me while closing your eyes or when your eyes are open?",
"Which lullaby song do you like the most?",
"Do you still remember our first time we cuddle?",
"Which one do you prefer between kissing for 1 second and hugging for 10seconds?",
"Can you kiss me on the nose?",
"Can you kiss me on my armpit?",
"Do you always feel comfortable holding my hand in public?",
"Can you take a bath with me?",
"What do you normally feel when I touch your back in public?",
"Where do you want I kiss you now?",
"Do you have a favorite place to be touched?",
"Do you like pool parties?",
"Do you prefer a male or female masseur?",
"What place do you go most for massage?",
"Which place are you longing that I kiss you?",
"Do you remember the date you lost your virginity?",
"Have you ever developed feeling for a male friend?",
"Which of your friends do you wish was your real brother?",
"Which among your Ex do you hate more for breaking your heart?",
"Which among your ex did you love more?",
"Which is your favorite kids songs?",
"Do you think I am the prettiest girl you ever met?",
"Do you trust me with your secrets?",
"Which pet do you want to keep?",
"How can you describe my body odor?",
"What do you always feel when I am sad?",
"What can you do to make me happy when I am feeling low?",
"Which sport would you wish to play between Rugby and American football?",
"Would you still take me if I cheat on you with your best friend?",
"Would you still love me if I had 2 children from my previous relationship?",
"Do you think I look prettier on make up?",
"Would you still love me when I add weight?",
"What did you think about me when I first told you I drink a lot?",
"Would you hold me if I am scared?",
"Do I look gorgeous while working out?",
"How did you feel about our first dance?",
"I’m I a pathetic dancer?",
"If I was a cartoon character, which role do you think I could play best?",
"Which kind of flower do you think describes me?",
"Where are you planning to take me on a picnic?",
"What outfit do you think makes me look prettier?",
"Do you feel comfortable when we go out with your friends who are single?",
"Do you think I am ready to meet your parent?",
"Do you watch Masha and Bear?",
"What could be your reaction when I say “I do not love you anymore”?",
"Which is the saddest movie you have ever watched?",
"What movie can you recommend for me?",
"Describe my physique in 5 words?",
"Does it make you feel happy when I tell you how handsome you are?",
"At what age do you think you pronounced your first word?",
"Do you mean it when you say you will never leave me?",
"Do you have any childhood memory you are fond off?",
"What breakfast do you want I make for you?",
"What was your first expression the first time you met my family?",
"Do you know how to ride a bike?",
"Where would you prefer to take me between a tropical vacation and camping?",
"Which word makes you blush?",
"Do you love my voice?",
"What is the craziest thing you do when alone in the house?",
"What do you like most about travelling?",
"Who was your childhood crush?",
"What did you think about ‘love’ after the first breakup?",
"Do you have the biggest fear?",
"Can you remember the day you were deeply hurt?",
"Cookies or cookie dough?",
"Do you prefer tea over coffee on a cold evening?",
"Between the cave and under the sea, where would you prefer to live?",
"Which title would you give your autograph?",
"If our college life was a movie, what title would you give it?",
"If you were to choose between me and your mother, whom would you choose?",
"Do you believe I will make the perfect mother for your children?",
"Do you love porridge?",
"Where do you see us in the next twenty years?",
"I’m I part of the source of your happiness?",
"Which song do you always relate to our love story?",
"What specific thing made you to have feelings for me?",
"What is it when you see it reminds you of me?",
"What came into your mind when we first met?",
"What do you find outstanding about me?",
"What name are you longing I call you?",
"Do you have any dream date?",
"Where do you wish our honeymoon to be?",
"What can I do to make you feel even more appreciated?",
"What do you wish I do for you in order to retain you forever?",
"Which one thing do you wish I correct since it pisses you off?",
"Any romantic fantasy that you long for?",
"Which colour is your favorite lingerie?",
"What do you wish I do in what you think makes a perfect night together?",
"When will you ever initiate s*x?",
"Are you a kind of lady who is ready to fight for long in case of a long distance relationship?",
"What is your ideal number for the kids you wish to have?",
"What time would you want to see your husband after work?",
"Do you mind keeping quite?",
"When do you want our wedding to take place?",
"Which country do you want us to do our wedding?",
"Have you ever find difficulties to ask me out on a date?",
"Other than initiating for s*x, what other traits makes you know I need us to make love?",
"What is your definition of a happy marriage?",
"Do I have a funny face?",
"Which cartoon was your favorite while a child?",
"If you had to choose a supernatural power. Which power would you choose?",
"Which dumbest question have you ever ask a girl?",
"Which awkward thing do you want us to do?",
"Have you ever beaten up a person till he/she got hospitalized?",
"What is your favorite activity while lonely?",
"What usually makes you laugh like crazy?",
"If your favorite actor proposes to marry you, will you leave me for him?",
"What will you buy me if you win five million dollars?",
"What would be your reaction if I slap you?",
"Have you ever cheated on me? And who’s most likely to cheat?",
"Which is your most romantic movie you ever watched?",
"When was the first time you ever saw a dead body?",
"Have you ever dated your girlfriend?",
"Have you ever slept with your girlfriend?",
"Which spot activity do you love watching?",
"Describe your ex-boyfriend in two words",
"Have you ever gone shopping without pants?",
"Are you always comfortable every time I check your bag?",
"Which country do you want I take you on a nature expedition?",
"Which country accent can you fake perfectly?",
"Have you ever had intimate feelings for your dad?",
"Have you visited a morgue? If yes, how was the experience?",
"What is your definition of intimacy?",
"Do you think I am anywhere close to a perfect man for you?",
"What could be your reaction if you find out am chatting with my Ex-girlfriend?",
"What did you use to hate most about your ex-boyfriend?",
"If you are given a chance to amend the issues that led to the breakup with your Ex, will you take that chance?",
"What is your saddest memory?",
"What do you think was the best thing your parent ever instill in you and has impacted your life for the better?",
"What is your worst food?",
"What is that thing that used to turn you off about me but you came to get used of?",
"What first person do you always pray for every time you pray?",
"What does a worst relationship entails according to you?",
"Have you ever been robbed? Where was it and how did you react?",
"How many times did your Ex cheated on you? How were you feeling each time you caught her?",
"Have you ever been diagnosed with depression?",
"I’m I the only one you always feel safe with your secret?",
"Which song when you listen makes you have hopes in life?",
"Can you give your boyfriend a second chance when you caught him cheating?",
"Could you allow my ex-girlfriend to sleep at our house either when you are around or out of town but am around?",
"Which decision do you regret the most in life?",
"Which advice do you think was the worst you ever got from a friend?",
"Which state do you wish to build your dream home?",
"Which celebrity family do you wish you were born in?",
"Which club do you always go for entertainment with friends?",
"Would you be comfortable in ‘come we stay’ marriage?",
"Do you have any hobby that you are always passionate about?",
"How often do you go to church?",
"Do you prefer to have a delicious exotic meal from a local hotel or a local fruit cake from a five star hotel?",
"Do you have that one spot which when a man touches you feel aroused?",
"Which dancing style do you see as your favorite?",
"Who is your favorite news anchor?",
"Which teacher did you use to hate while in high school?",
"What is your biggest obsession?",
"What impresses you the most?",
"What title could you give your life if it was a book?",
"Do you think your life will change for the worst five years from now?",
"Which religious leader is your biggest inspiration in life?",
"How often do you booze?",
"Mention one thing that always makes you happy?",
"Sajio Mane, Victor Wanyama or Ewobi?",
"Do you like action flicks or chick flicks?",
"What do you think is your worst car brand?",
"When do you think you will be able to purchase your dream car?",
"Do you like country music?",
"What do you hate about Halloween?",
"How can you define a perfect morning?",
"How many languages do you speak fluently?",
"Which soap opera can you call your best ever?",
"Have I ever embarrassed you in public?",
"Have you ever been pranked?",
"Do you prefer shower or bath?",
"What is your blood group?",
"Have you ever taken a nude selfie?",
"Do you remember the first time you ever gossiped?",
"When did you ever been pulled over by a police?",
"Have you ever inquired about your lineage?",
"Have you fulfilled half your desire in life so far?",
"Do you remember the last time you lie?",
"Have you ever showered in the rain?",
"What is the craziest lie you ever told your boss so that you wouldn’t go to work?",
"Would you be okay if I borrow your phone for a minute?",
"What was the reaction of the craziest prank you made to your girl friends?",
"The most awkward complement you ever got?",
"Have you ever trusted anyone with your life?",
"What can you say is your greatest weakness and what do you see as your greatest straight?",
"Do you love pizza?",
"Which is your favorite pizza type?",
"What comes in your mind every time you wake up?",
"What can you choose in life between being quite beautiful but a short lifespan or ugly but live longer?",
"What can you do if you realize your ten year old child is not yours ? Was as a result of the confusion from the nurses at the hospital during delivery",
"Can you lie in court to save your best GF from life imprisonment even if she committed murder?",
"Are you close to your family?",
"Can you take a glass of mixed mucus from forty different people for 50000$?",
"In case you are given a chance to choose a person to torture for a day. Whom will you choose?",
"Can you shelter your children from life reality?",
"What do you wish to witness in life?",
"What would you do if you wake up one day in the body of the world richest billionaire?",
"If you were given a chance, what age would you wish to stay in for 10years?",
"What turn off questions do boys ask you?",
"What is your favorite diet that you can have your entire life?",
"Which cyber café do you prefer for browsing?",
"What do you think is the best way of starting a conversation?",
"Which keys on your computer keyboard do you always find a hard time searching?",
"If you are given a chance to go for brainwashing, would you go for it? If not whom would you wish done on?",
"Picture this, you are at home at night and there is a power outage. You see something moving but it is not clear. What would be your reaction? And what would you think is?",
"Which is the most awkward name have you ever heard in your life?",
"What were you doing in the last 24hours? Do you enjoy doing it or you were doing it out of necessity?",
"What is the strangest thing have you ever eaten? Where did you eat it?",
"What kind of the event preparation is this?",
"What lifts you up each time you feel down?",
"What event always make you sad every time you think about what unfolded?",
"Do you always feel unsatisfied with your current job?",
"Are you a fun of reading books? Why or why not? Which is your favorite book?",
"How long have you ever stayed awake? 10hours, one day? One week? One month?",
"Whom do you trust with your secrets that you always go for advice or consult always?",
"Which habit do you wish to get rid off but it has proven to be a hard nut to crack?",
"What are you thinking?",
"What do you normally eat every time you go to a restaurant or fast food outlet?",
"Which word do you like using? Which one do you least use in your day to day activities?",
"Which mysterious event that you have no explanation on what transpired in your life?",
"Have you never celebrated your birthday? If yes, what happened and what was your feeling after that?",
"Which is your favorite holiday? Are you a spiritual lady?",
"If you a given an opportunity to be named after something, a place or event, which one would you choose?",
"Whom do see as your hero or heroine so far?",
"Which is your point of reference or clarity? Google, dictionary or quora?",
"Have you ever visited an animal park or game reverse?",
"Which pet do you like?",
"Whom do feel is the mostly untalented singer and should just look for a different career?",
"Can you fully define the person you are today?",
"What are you most afraid of in this life? Is heights part of it?",
"Do you love dancing? Who is your favorite dancer?",
"Who is your Hollywood actor crush?",
"Which is the worst injury have you got in life?",
"When did you last go to watch a movie in a cinema?",
"What is your dream country that you wish to visit in the next 5 years?",
"How often do you workout?",
"Do you like wearing panties/ boxers?",
"When did you last make an impulse buying and what was it?",
"Which is your favorite shoes color?",
"Which game do you wish to play but you are not capable?",
"Picture this, you are given a chance to meet a historian. Whom would you choose and what is the driving force see that person?",
"Describe your boyfriend or girlfriend in 3words(if you don’t have, describe one member of your family)",
"Mention your best drama show",
"Of all the dying methods, which method of dying would you choose?",
"Mention the weather season you love and the one you hate. Why?",
"Do you like bathing cold water? Why or why not?",
"Which is your favorite animated film?",
"Are you a fun of Kim Kardashian?",
"Which animal would you not wish to be in the next life?",
"Which TV character resembles you in term of character and physique",
"Whom would you wish to have a date with?",
"Which is your worst nightmare?",
"Which horror do you least wish to be chased with?",
"Do you still believe that honest people exist in this world?",
"Which among the United State of America presidents to you hate the most and whom do you love? Why?",
"Whom would you raise back to life if given the power to raise only one person?",
"Do you believe that Muslims are the most ruthless and heartless people especially on their stand on women right?",
"Mention the most terrifying even in your life. What was the recovery process? Have you recovered from the ordeal?",
"Which television personally do you think resembles your father?",
"Which is your favorite soft beverage?",
"Are you a chronic drunkard?",
"When did you last took alcohol? Do you remember what you did when drunk and what did your friends say about your behavior?",
"Have you ever been jailed? If yes, what had you done?",
"What do you think is the most weird sleeping position?",
"Have you ever cheated on your partner? How was the experience?",
"Have you ever eaten a guava? Do you like it?",
"Which food do you like cooking during Christmas?",
"What do you love about our house?",
"Does whatever you always think about a person you meet always right?",
"Which do you see as your favorite advertisement?",
"What do you hate about your parents?",
"Which is that you cannot survive without?",
"Have you ever hooked up with your crush?",
"What comes in your mind each time you meet your crush?",
"Which date and month do you cherish the most? Why?",
"Do you have any likes and dislikes?",
"Whom are you very close to?",
"What is your definition of a close friend?",
"Which is your favorite zodiac?",
"Whom do you love talking to?",
"Do you think you are an introvert or extrovert?",
"What things makes you annoyed?",
"What is your definition of happiness?",
"What things makes you feel crazy?",
"What place do you visit most when you feel sad/lonely",
"Between your Dad and mum, whom are you so close to?",
"Are you a member of any dating site?",
"Do you have any idol person in your family?",
"Do you feel like you ain’t getting enough support from your family?",
"Who is your favorite sibling?",
"Which of your siblings are you very close to?",
"Which is your favorite color?",
"How many girls/boys have rejected your marriage proposal?",
"McDonald’s or Kentucky Fried Chicken?",
"What event changed your s*x life?",
"What do you wish to forget but it has stuck in your mind?",
"How many lies do you tell in a day?(average)",
"When you went for shopping, did you stare at any lady/man in the supermarket?",
"How often do you take a bath in winter?",
"What are you planning to do for your parent as a sign of appreciation?",
"Whom do you wish to meet again?",
"Did you cheat in your final exams?",
"Do you feel like some of your dreams are unrealistic?",
"How many times have you lied to me ever since we met?",
"What is the most expensive gift you ever bought a friend?",
"What image comes in mind every time you listen to your favorite song?",
"What best thing are you planning for me?",
"Which among your Ex do you think was the best kisser?",
"Which song reminds you of your former lover?",
"Do you still remember your first love favorite song?",
"Do you remember what your first romantic date was like?",
"Do you love wild romance?",
"What makes you think you are romantic?",
"What is your role in your Church?",
"How sure are you that you will fulfil your dreams?",
"Whose advice do you always take seriously?",
"Have you ever contemplated to committee suicide? If yes, what was the driving force?",
"What things must you do on daily basis at all cost?",
"What thinks do you wish to avoid but they prove to be next to impossible?",
"Which dream job are you ready to sacrifice everything until you get it?",
"When do you think you will be competent for your dream job?",
"At what age do you think you will have fulfilled most of your dreams and you will see yourself as a successful man/lady?",
"Which is the best moment in your life?",
"Do you always expect favors from the person you have given a gift?",
"Whom do you think you cannot live without?",
"Do you remember the day you were $exually assaulted?",
"How many times have you traveled by air?",
"Whose company have you enjoyed the most in your life?",
"What can you do if given a chance to do anything with an opposite gender?",
"Can you sleep with a stranger in the same house? Only the two of you?",
"What could you ask from God if He gives you a chance to ask for anything?",
"If given a chance to kiss someone you like, who will that be?",
"Which is your magic word?",
"Picture this. Your family want you to marry a person you don’t like or they ex communicate you. What will you do?",
"Can you marry someone you do not like just to please your family?",
"What would you do if your parent tells you that they are not your real parents. What would you do?",
"What would you do if you go out with your crush and he/she falls in love with another person?",
"Can you sleep with your crush on the first date?",
"What food do your boyfriend/ girlfriend like?",
"Do you have strong feelings for your boyfriend/girlfriend?",
"Which is your favorite hotel destination?",
"Which pet do you like the most and you are ready to keep several?",
"Which one do you prefer; Diamond or Gold?",
"What are you addicted to?",
"Have you ever had more than one lover at the same time?",
"What did you do you buy with your first salary from your first job?",
"When did you last saw your crush?",
"Whom don’t you want to meet again?",
"Are you a non-vegetarian or a vegetarian?",
"What do you love most about kids?",
"What gift would you buy your wife the moment she gives birth?",
"Do you have any TV show that you cannot miss any episode?",
"Which politician could you marry?",
"Which movie do you think is the most boring ever?",
"Which bird do you like the most?",
"Would you accept me if I propose to you right now?",
"What nickname do your parents call you?",
"Which types of socks do you like?",
"What nickname do you hate the most?",
"What do you except from your lover?",
"Can I take you out today?",
"What do you value the most in life?",
"Where will you take your partner for honeymoon?",
"Do you have any precious thing in life?",
"What place do you think is the best for picnic?",
"What is it that you must carry before living the house?",
"Define your bad day in 6 words?",
"How many hours do you work out per day?",
"What is your dream smartphone?",
"Are you still a teen?",
"Would you rather be an insect or worm?",
"Do my character make you angry?",
"Was my existence accidental?",
"How many boyfriend had you have before meeting my dad?",
"When did you met my dad?",
"Where did dad take you on your first date?",
"Do you really love me or you just saying for the sake?",
"Why do you keep swearing but you don’t want me to do the same?",
"Has dad ever hit you?",
"Have you ever divorced with dad?",
"Do you love dad?",
"What do you hate about dad?",
"Which was your favorite haircut while a teen?",
"How old were you when you gave birth to me?",
"Which country do you prefer to go for shopping for the best wardrobe collection?",
"When do you think will be the ideal time that I should get married?",
"What type of girl do you wish I marry?",
"Would you still support my decision if I decide to be g@y?",
"What did you do while you were a teen that you do not wish I do?",
"What is it that you regret the most and you don’t wish I experience the same situation?",
"Where did dad take you on your honeymoon?",
"Which drugs did you abuse the most while a teen?",
"what is the name of the friend ho introduced you to illegal drugs abuse?",
"What teenage activity do you miss a lot?",
"At what time was I born?",
"I’m I exactly what you wished for?",
"Why did you decide to have only one child?(me)",
"Did you ever contemplate to abort me?",
"Have you ever done an abortion?",
"How many months did you breastfeed me before introducing me to food?",
"Did you have low self-esteem with the baby weight?",
"Do you have regrets of why you married my dad?",
"Did you have crazy moments why in campus?",
"What struggles did you have to endure to be who you are?",
"Where do you see me in the net 11 years?",
"Have you ever thought cheating on dad?",
"Have you ever cheated your way for promotion?",
"Tell me how your wedding day way?",
"Which town did your parents wed?",
"What do you find weird about our culture?",
"Was your love with dad at first sight?",
"Tell me the number of times you were heart broken before meeting dad?",
"Where you rebellious while a child?",
"Which sport did you play while a teenage?",
"Who is your best country music star ?",
"Are you planning to go back to school?",
"Do you still keep secrets from dad?",
"Tell me the biggest secret that you do not want dad to know about you?",
"Whom among your friends don’t you trust?",
"How many countries have you visit so for?",
"In a scale of 100. What is your love to me?",
"How was your relationship with your mum like?",
"What do you think entails a perfect father?",
"What thinks have you ever gave up on?",
"How can you describe your relationship with mum ever since you met?",
"Between you and mum, who approached who?",
"How long did you date mum before proposal?",
"Do you love mum?",
"Any experience in an Intensive Care Unit?",
"What things builds a strong relationship?",
"Your worst dancing move?",
"Do you plan to join politics?",
"Why do you hate politics that much?",
"What event taught you the greatest life lesson?",
"Have you ever bribed a police officer over a traffic offense?",
"Are you still chasing your dreams or you are living it?",
"What do you consider as the greatest failure in life?",
"What caught your attention the first time you saw mum?",
"George Bush, Barack Obama or Donald Trump?",
"Which was the most difficult year in your life?",
"Have you ever had doubts about me being your child?",
"Do you consider confidence as the key to success?",
"When did you buy your first car?",
"Christianity, Buddhism or Islamic ?",
"Are you planning to marry the second wife?",
"Tell me your greatest achievement so far?",
"Kenny Rodgers, Michael Jackson or Chris Brown?",
"Any childhood fantasies that never come to pass?",
"Have you ever cheated on the previous relationships before meeting mum? And what about on mum?",
"What is the first thing that comes in your mind every time you have a bad dream?",
"What are your plans for the family?",
"Sony, Samsung or LG(Life is Good)?",
"Do you think the only path to becoming a millionaire is by being a businessman and not just relying on a formal job?",
"Do you think education has a limit?",
"Why did you drop out of college?",
"How many ladies did you date in college?",
"Did you see your father as your role model?",
"Do you have any habit that is in contrast with your core value?",
"What qualities do you want me to look for in the potential wife/husband?",
"What were your parent’s occupation?",
"What do you wish I buy for you?",
"What challenges comes with being an adult?",
"What do you see as the greatest invention of all time?",
"Do you see anything awkward with the way our generation carry itself?",
"Have you ever took us to watch a movie in a cinema?",
"What do you like and dislike about my dress code?",
"Do you think smoking shisha is worst that bang?",
"When was the last time you smoke shisha?",
"How often did your parents argue?",
"Do you love grandma more than grandpa?",
"What do you hate about growing old?",
"How are you today?",
"I am Zebedayo, what’s your name gorgeous?",
"What can I call this beautiful lady standing in front of me?",
"Are you a Christian?",
"You have nice shoes, where did you buy them?",
"Is it your first time to take a flight like me?",
"When did you last take a bath? You smell fresh dear",
"Wow! You have the same model of the phone like mine. How is your experience?",
"You have a nice Necklace, where did you buy it?",
"Hi, you look familiar, are you from around here?",
"Are you still searching or you have found your missing rib?",
"Who is the craziest person you have ever met?",
"What is the lowest marks you got in high school?",
"Have you ever been number one in exams in class?",
"Have you ever been number last in class?",
"Do you believe in spirits?",
"Do you believe in karma?",
"Are you a great fun of the current president?",
"How can you tell if someone is lying to you?",
"How often do you get angry ?",
"What is the most silly lie did you tell?",
"Do you believe in gender equality?",
"Where you a supporter of Barrack Obama?",
"How many times have you admitted your mistakes and asked for forgiveness?",
"Which household chore do you enjoy doing?",
"Which house chore do you hate doing and you always do everything to avoid doing?",
"Can you marry a broke guy?",
"Which is your favorite record label?",
"Which do you think is the worst disaster that can ever hit the world?",
"Can you walk in the streets naked?",
"Do you think some actions need to be punished?",
"Name three actions that you think deserves severe punishment?",
"Do you imagine life without the internet?",
"When were you first introduced into the social media?",
"Have you ever imagine where God used to live before the creation of the world?",
"Have you ever asked yourself who created God or where He came from?",
"Do you perform any rituals on the daily basis?",
"Which horror movie do you like?",
"I’m I the only one feeling this place is not safe?",
"Do you perform any ritual before end year or at the beginning of the year?",
"How many times have you fast?",
"Do you think we should live today like there is no tomorrow?",
"When did you last confess your sin?",
"Do you prefer tablets/capsules or injection when you are sick?",
"Have you ever imagine where you will be 30 years from now?",
"Will you be the best grandparent?",
"Do you hate your name and you wish to change?",
"Have you ever been forced to make a public apology for the crime you did not commit?",
"Have you ever met your favorite movie star?",
"When did you last watch a marvel cinematic universe film?",
"Have you ever made a fun clip?",
"Have you ever cried because of someone special?What happened?",
"When did you last ate candy?",
"Have you ever been caught stealing?",
"How long do you take to check for email updates or phone conversation?",
"Can you stay a week without the internet or phone?",
"Do you think that Bitcoin will be the next pyramid scheme?",
"Have you invested in bitcoins?",
"When was it when you were first introduced to cryptocurrencies?",
"Are you planning to pursue a Phd degree? Why?",
"If you were to be an endangered species, which one do you think you could have been?",
"Picture this. You are 30years then you are given an opportunity to sit with your 14 years self. What will you tell him/her?",
"What would you buy if given 500$ to spend it within 15minutes?",
"Name three things that you cannot forget while going on a road trip?",
"What quality do you normally look for while looking for partner on dating sites?",
"Which dating sites do you visit?",
"When did you last look for love in a dating site?",
"Do you think you can find the perfect husband/ wife from dating sites?",
"What is your area of specialization career wise?",
"Which life skills do you think comes natural and you do not need to be taught?",
"What place do you prefer for adventure?",
"How much were you paid in your first job?",
"Which is your worst hair cut style?",
"Which year was the turning point for your life?",
"Whom among your parents are you most proud of?",
"What one mistake you find yourself repeating every now and then?",
"What cake flavor do you prefer for your birthday?",
"Do you know how to bake a cake?",
"Have you ever gone on a date with a stranger you just met on social media?",
"What do you think is your worst job that you will never do?",
"What do you cherish in life?",
"What Chinese action movie do you love?",
"What do you prefer to be between a sociable but broke or a billionaire but lonely?",
"Do you like writing story books?",
"Whom among your friends never seize to disappoint?",
"What motivates you the most?",
"Have you ever visited South Africa?",
"which is your most embarrassing guilty pleasure?",
"Which name of the famous person will you give your first born?",
"How much money are you planning to make before you retire?",
"What do you think is the highlight of your week?",
"Which is your favorite Katy Perry song?",
"Did you watch last night game?",
"Which do you consider as the scarest Halloween costume?",
"Have you ever celebrated your birthday outside the country?",
"Which country did you last celebrated your birthday?",
"what do you think I do not know about you?",
"What is your favorite name?",
"Have you ever read any of Chinua Achebe books?",
"Have you ever had difficulties starting a conversation with a stranger?"
]