[
"Ducks have been domesticated as pets and farm animals for more than 500 years, and all domestic ducks are descended from either the mallard or the Muscovy duck. Mallards, especially, are easy to crossbreed with other types of ducks, and mallards often hybridize with all types of ducks at local ponds.",
"The eggs will hatch within 28 days normally, except for the Muscovy duck which takes about 35 days to hatch. The mother duck will keep her brood of ducklings together to protect them from predators.",
"The production of eggs is affected by daylight. When there is more daylight, the ducks will lay more eggs. To prevent this from happening, farmers use artificial lighting so that the ducks have about 17 hours of light a day to produce eggs efficiently.",
"Ducks can live up to 20 years, depending on the species and if well cared for.",
"Ducks are birds. Ducks are also called ‘waterfowl’ because they are normally found in places where there is water like ponds, streams, and rivers.",
"Ducks are outgoing, social animals who feel most at ease when they're in a larger group of other ducks.",
"Most duck species are monogamous for a breeding season but they do not often mate for life. Instead, they will seek out new mates each year, choosing the healthiest, strongest, best mate who can help them pass on their genes to a new duckling generation.",
"Ducklings younger than 10 days tend to swim and walk as a group, always close to their mother, to avoid the attack of predators.",
"Ducks are omnivorous and will eat grass, aquatic plants, insects, seeds, fruit, fish, crustaceans and other types of food.",
"All ducks have highly waterproof feathers. A duck's feathers are so waterproof that even when the duck dives underwater, the downy underlayer of feathers right next to the skin will stay completely dry.",
"Ducks have featured as popular cartoon characters over the years, such as Walt Disney's Donald Duck and Warner Brothers, Daffy Duck.",
"Ducks have many economic uses. Their feathers, particularly their underlying 'down' feathers, are used in many products, while the white Pekin duck is the most common variety raised for eggs and meat.",
"All ducks have highly waterproof feathers due to the feathers interlocking nature and waxy coating.",
"Paradise Shelducks of New Zealand often have one mating partner for life.",
"Mallard ducks live 5 to 10 years in the wild and 8+ years in captivity.",
"The male Mallard has a glossy green head, grey wings and belly, while the female has a brown-speckled plumage. Mallard ducks have a moulting season, they are vulnerable during this time as the moulting stops them flying.",
"The most common and recognised species of duck is the Mallard or Wild duck. It is a dabbling duck that lives in the Americas, Europe, Asia, North Africa, and has been introduced to New Zealand and Australia.",
"Ducks are curious and friendly creatures they have been domesticated as pets and farm animals for more than 500 years. All domestic ducks are descended from either the Mallard or the Muscovy duck.",
"A common urban legend is that a ducks quack does not echo. This has however, been proven to be false.",
"Dabbling ducks feed on the surface of water, on land, or by ducking their head underwater. Along the edge of their beak is a comb-like structure called a pecten, that enables them to hold slippery food and filter nutrients out of the water.",
"Diving ducks and sea ducks search for food fairly deep underwater. To be able to stay underwater more easily, diving ducks are quite heavy.",
"Ducks are omnivores. They feed on aquatic plants, small fish, insects, worms, grubs and more. People often feed domesticated ducks bread.",
"Ducks are mostly aquatic birds living in both fresh water and sea water and found on every continent except for Antarctica.",
"The duck is a number of species in the Anatidae family of birds. They are related to swans and geese.",
"Duck’s feet can’t feel cold.",
"Duck’s quacks do echo.",
"Ducks eat rocks.",
"Ducks have three eyelids.",
"Ducks have different names.",
"The fastest duck was a Red-breasted Merganser.",
"Ducks can fly as high as airplanes.",
"Ducks are hard to sneak up on.",
"Ducklings mature quickly.",
"Preening helps ducks stay dry."
]